Config/InformationRegisters/ОтветственныеИсполнителиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеИсполнителиПользователей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособВыбораОтветственногоЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособВыбораОтветственногоЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковУчреждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзСотрудниковУчрежденияИЦБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/ОтветственныеИсполнителиПользователей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") Тогда
		ИзмененныеПараметрыВыбора = Новый Массив;
		ПараметрыИзМетаданных = Метаданные.НайтиПоТипу(Тип("РегистрСведенийЗапись.ОтветственныеИсполнителиПользователей"))
			.Ресурсы.Сотрудник.ПараметрыВыбора; 
		Для Каждого Парам Из ПараметрыИзМетаданных Цикл
			ИзмененныеПараметрыВыбора.Добавить(Парам);
		КонецЦикла;
		ИзмененныеПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЦентрализованнаяБухгалтерия",
			Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить()));
		ИзмененныеПараметрыВыбора.Добавить(Новый ПараметрВыбора("СпособВыбора",
			ПредопределенноеЗначение("Перечисление.СпособВыбораОтветственногоЦБ.ИзСотрудниковУчрежденияИЦБ")));
		Элементы.Сотрудник.ПараметрыВыбора = Новый ФиксированныйМассив(ИзмененныеПараметрыВыбора);
	КонецЕсли;
	
	ОграничиватьПоПользователю = УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей()
		И Не Пользователи.ЭтоПолноправныйПользователь(,, Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Пользователь",
		"ТолькоПросмотр", ОграничиватьПоПользователю);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти
